In [1]:
import pandas as pd

In [2]:
people = {
    "first": ["Rifat", "Masum", "Sayem"], 
    "last": ["Muhtasim", "Abdullah", "Ahmed"], 
    "email": ["rifatmuhtasim@tavlav.com", "abdullah_masum@gmail.com", "sayem_ahmed@email.com"]
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first      last                     email
0  Rifat  Muhtasim  rifatmuhtasim@tavlav.com
1  Masum  Abdullah  abdullah_masum@gmail.com
2  Sayem     Ahmed     sayem_ahmed@email.com

In [5]:
## Combining Columns

df['full_name'] = df['first'] + ' ' + df['last']

In [6]:
df

   first      last                     email       full_name
0  Rifat  Muhtasim  rifatmuhtasim@tavlav.com  Rifat Muhtasim
1  Masum  Abdullah  abdullah_masum@gmail.com  Masum Abdullah
2  Sayem     Ahmed     sayem_ahmed@email.com     Sayem Ahmed

In [14]:
## Remove Columns

df.drop(columns=['first', 'last'], inplace=True)

In [15]:
df

                      email       full_name
0  rifatmuhtasim@tavlav.com  Rifat Muhtasim
1  abdullah_masum@gmail.com  Masum Abdullah
2     sayem_ahmed@email.com     Sayem Ahmed

In [17]:
## String Split
df['full_name'].str.split(" ")

## Expand
df['full_name'].str.split(" ", expand=True)

       0         1
0  Rifat  Muhtasim
1  Masum  Abdullah
2  Sayem     Ahmed

In [20]:
## Add Multiple Columns

df[['first', 'last']] = df['full_name'].str.split(" ", expand=True)
df

                      email       full_name  first      last
0  rifatmuhtasim@tavlav.com  Rifat Muhtasim  Rifat  Muhtasim
1  abdullah_masum@gmail.com  Masum Abdullah  Masum  Abdullah
2     sayem_ahmed@email.com     Sayem Ahmed  Sayem     Ahmed

In [26]:
## Add a row and ignore the index
new_row = pd.Series({"email": "cto@tavlav.com"}, name=len(df))
df = df.append(new_row)

AttributeError: 'DataFrame' object has no attribute 'append'

In [7]:
## Drop Rows
df.drop(index=1)
df

   first      last                     email       full_name
0  Rifat  Muhtasim  rifatmuhtasim@tavlav.com  Rifat Muhtasim
1  Masum  Abdullah  abdullah_masum@gmail.com  Masum Abdullah
2  Sayem     Ahmed     sayem_ahmed@email.com     Sayem Ahmed

In [10]:
## Remove Rows 
filt = df['last'] == "Ahmed"

df.drop(index = df[filt].index)

   first      last                     email       full_name
0  Rifat  Muhtasim  rifatmuhtasim@tavlav.com  Rifat Muhtasim
1  Masum  Abdullah  abdullah_masum@gmail.com  Masum Abdullah